<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a0d9ece5f78f4113b8d068e21fa3d740050f52a8a0f9e1534d0fcbe050e2f138","plan_job_ref":"Job Terraform plan #28 at https://github.com/mkuthan/stream-processing/actions/runs/7250938674","plan_hash":"6d14ab9ffc6c4699e3eafc37de1c0caa9a87080b402cc4c75c9dfa0b1df70904","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-entry"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-exit"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
  + resource "google_pubsub_subscription" "vehicle-registration-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "vehicle-registration"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #28](https://github.com/mkuthan/stream-processing/actions/runs/7250938674)